[
  {
    "id": "default-guide-001",
    "title": "Welcome to LOTUS AI Knowledge Hub! (How to Use)",
    "content": "Welcome to **LOTUS AI Knowledge Hub**! This application is designed to help your startup team manage, share, and discover information efficiently. Here's a quick guide to get you started:\n\n### 1. Adding New Knowledge:\n   - Click the \"**Add New Entry**\" button (usually at the top right or near the search bar).\n   - Fill in the *Title*, *Content* (in Markdown!), *Category* (optional), and *Tags* (comma-separated, optional) for your knowledge item.\n   - Click \"**Create Item**\" to save it. Your changes are saved automatically in your browser's local storage.\n\n### 2. Finding Information:\n   - Use the **search bar** at the top to quickly find items. You can search by title, content, category, or tags.\n\n### 3. Managing Entries:\n   - Each knowledge item is displayed as a card.\n   - **Edit**: Click the pencil icon (Edit) on a card to modify its details.\n   - **Delete**: Click the trash can icon (Delete) on a card to remove it. You'll be asked for confirmation.\n\n### 4. AI-Powered Summaries:\n   - For lengthy content, you can generate a concise summary using AI.\n   - Click the sparkles icon (Generate AI Summary) on a card.\n   - **Important**: This feature requires a valid Gemini API Key. If `process.env.API_KEY` is not configured, the AI summary generation will not work, and you'll see a notification. The application itself does not ask for or store your API key directly; it must be set up in the environment where the app is run.\n   - The generated summary will then be displayed on the card (and saved with the item).\n\n### 5. Data Management (Using Markdown Import/Export):\n   - **Export Data**: Click the \"**Export**\" button (in the header) to download all your knowledge base items as a `.zip` file. This ZIP contains individual Markdown (`.md`) files, each with its metadata (title, category, tags, etc.) in YAML frontmatter. This is great for backups or sharing.\n   - **Import Data**: Click the \"**Import**\" button to upload:\n      - A single Markdown (`.md`) file with frontmatter.\n      - A `.zip` file containing multiple `.md` files structured with frontmatter.\n   - This will replace your current knowledge base data (including what's in your browser's storage) with the data from the file(s).\n   - **Initial Data**: The app will attempt to load initial data from this `/data/knowledge_base.json` file if your browser's storage is empty.\n\n### Tips for Effective Use:\n   - Use descriptive titles.\n   - Write content using **Markdown** for formatting (headings, lists, bold, etc.).\n   - Utilize categories and tags for better organization and faster searching.\n   - Regularly back up your data using the Export feature.\n\nWe hope this AI Knowledge Hub empowers your team!",
    "category": "Getting Started",
    "tags": ["guide", "howto", "markdown", "app features", "ai", "welcome"],
    "createdAt": "2025-05-25T00:00:00.000Z",
    "updatedAt": "2025-05-25T00:00:00.000Z",
    "summary": "A quick guide on how to use the AI Knowledge Hub, covering adding entries (Markdown), searching, AI summaries, and Markdown-based data import/export."
  }
]
